BbllYLL/stm32-learn-code/17-1蓝牙发送/Hardware/Serial.c
#include "stm32f10x.h"                  // Device header
#include <stdio.h>
#include "OLED.h"
#include "LED.h"
#include <string.h>

void BL_LED_Turn(void);

char Serial_RxString[100];
uint8_t Serial_TxPacket[4];
uint8_t Serial_RxPacket[4];
uint8_t Serial_RxFlag;

void Serial_TxPacket_Get(char *TxPacket, uint16_t Length)
{
	int16_t i;
	for(i = 0; i < Length; i++)
	{
		Serial_TxPacket[i] = TxPacket[i];
	}
}

void Serial_RxPacket_Get(char *RxPacket, uint16_t Length)
{
	int16_t i;
	for(i = 0; i < Length; i++)
	{
		RxPacket[i] = Serial_RxPacket[i];
	}
}

void Serial_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);	
	
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = 115200;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_Init(USART1, &USART_InitStructure);
	
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	
	USART_Cmd(USART1, ENABLE);
}

void Serial_SendByte(uint8_t Byte)
{
	USART_SendData(USART1,Byte);
	while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
}

void Serial_SendArray(uint8_t *Array, uint16_t Lenght)
{
	uint16_t i;
	for(i = 0; i < Lenght; i++)
	{
		Serial_SendByte(Array[i]);
	}
}

void Serial_SendString(char *String)
{
	uint8_t i;
	for(i = 0;String[i] != '\0';i ++)
	{
		Serial_SendByte(String[i]);
	}
}

uint32_t Serial_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while(Y--)
	{
		Result *= X;
	}
	return Result;
}

void Serial_SendNumber(uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for(i = 0; i < Length; i ++)
	{
		Serial_SendByte(Number / Serial_Pow(10, Length - i - 1) % 10 + 0x30);
	}
}

int fputc(int ch, FILE *f)
{
	Serial_SendByte(ch);
	return ch;
}

void Serial_SendPacket(void)
{
	Serial_SendByte(0xFF);
	Serial_SendArray(Serial_TxPacket, 4);
	Serial_SendByte(0x0A);
	
}

uint8_t Serial_GetRxFlag(void)
{
	if(Serial_RxFlag == 1)
	{
		Serial_RxFlag = 0;
		return 1;
	}
	return 0;
}

void BL_Hex_State(void)
{
	static uint8_t RxState = 0;
	static uint8_t pRxState = 0;
	if(USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == SET)
	{
		uint8_t RxData = USART_ReceiveData(USART1);
		
		if(RxState == 0)
		{
			if(RxData == 0xFF)
			{
				RxState = 1;
				pRxState = 0;
			}
		}
		else if(RxState == 1)
		{
			Serial_RxPacket[pRxState] = RxData;
			pRxState ++;
			if(pRxState >= 4)
			{
				RxState = 2;
				pRxState = 0;
			}		
		}
		else if(RxState == 2)
		{
			if(RxData == 0x0A)
			{
				RxState = 0;
				Serial_RxFlag = 1;
			}
		}

	}
	USART_ClearITPendingBit(USART1, USART_FLAG_RXNE);

}

void BL_Text_State(void)
{
	static uint8_t RxState = 0;
	static uint8_t pRxState = 0;
	if(USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == SET)
	{
		uint8_t RxData = USART_ReceiveData(USART1);
		
		if(RxState == 0)
		{
			if(RxData == '@')
			{
				RxState = 1;
				pRxState = 0;
			}
		}
		else if(RxState == 1)
		{
			if(RxData == 0x0A)
			{
				RxState = 0;
				Serial_RxString[pRxState] = '\0';
				Serial_RxFlag = 1;
			}
			else
			{
				Serial_RxString[pRxState] = RxData;
				pRxState ++;			
			}
		}
	}
	USART_ClearITPendingBit(USART1, USART_FLAG_RXNE);
}

void USART1_IRQHandler(void)
{
	BL_Text_State();
	BL_LED_Turn();
}

void BL_LED_Turn(void)
{
	if(Serial_GetRxFlag() == 1)
	{		
			
		OLED_ShowString(4, 1, Serial_RxString);
		if(strcmp(Serial_RxString, "LED_Turn") == 0)
		{
			LED1_Turn();
			if(GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_1) == RESET)
			{
				OLED_ShowString(4,1,"                ");
				OLED_ShowString(4,1,"LED1_ON_OK");
				Serial_SendString("LED1_ON_OK\r\n");
			}
			if(GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_1) == SET)
			{
				OLED_ShowString(4,1,"                ");
				OLED_ShowString(4,1,"LED1_OFF_OK");
				Serial_SendString("LED1_OFF_OK\r\n");
			}

		}

	}

}
